- 0929新版汉化补丁依赖DXVK工具，未安装DXVK会导致**调整画质后游戏闪退**。

- **安装DXVK会同时导致游戏无法正常识别显存**（使用-availablevidmem  2000可以解决此问题，见此[👉常见错误文档](https://docs.qq.com/doc/p/96d6b9b4160c54c355ad4e8eaf8326f8dda0f641)）

- **新版文本较0614旧版，经过二次修复校润，且支持RGL*正版。能接受请下载新版，反之旧版。**

*本页面提供的新版汉化已整合dxvk2.1_32mod（该dxvk需要win10系统+N卡510.470.3/Intel22.0以上的显卡驱动）和显存修改补丁，默认可用显存在release - commandline.txt文件中修改。默认填写了2000，已经完全满足gta4，别改直接玩就行。而旧版则啥也没整，主打的就是一个纯净。*

*停止维护的旧版DXVK1.10.3支持N卡470驱动（显卡驱动低于此版本不能使用任何DXVK，但仍能使用新版汉化，如果你能忍受调画质 在更新后游戏黑屏弹框的话），有能力的话，可以自行下载旧版DXVK1.10.3来替换补丁中自带的新版DXVK，用以解决你不想更 新驱动但硬件达标的尴尬局面。*


- DXVK的资源已经放进赠品目录，解决问题的**同时还能提高游戏帧数和稳定性**。两版汉化均支持DXVK。**如果出现D3D或者SHFX系列的错误弹窗，说明电脑不支持**`DXVK`**，硬件/驱动太老，要么更新硬件/驱动，要么删除DXVK。**

  
   *更换汉化版本：直接覆盖文件。*
 
   *删除DXVK：删除d3d9和dxgi.dll*
 
   *删除汉化：删除plugins/GTA4.CHS.asi*
 
   
   *<del>（A卡驱动就不提了，毕竟A卡战未来。不更新驱动的人是不配用A卡的！！！）</del>*

   *RGL* * *：即RockStar Games Launcher，R星自家的游戏平台，无关steam/EPIC，也是GTA6全球唯一指定首发平台，下文同。*